IDEA Open Model
LoadOnLine.Geometry Property
Compatible with IDEA StatiCa v 10.1
 Segment3D or PolyLine3D
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public ReferenceElement Geometry { get; set; }
Public Property Geometry As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Geometry {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
LoadOnLine Class
IdeaRS.OpenModel.Loading Namespace